For completeness - using `0.5GB` in `terraform` also leads to the same replacement if you write the program once and do `terraform apply` twice in a row.

```
resource "aws_ecs_task_definition" "service" {
  family                = "service"
  container_definitions = "${file("service.json")}"
  memory = "0.5GB"
}

resource "aws_ecs_cluster" "cluster" {
  name = "tftest"
}

resource "aws_ecs_service" "nginx" {
  name            = "nginx"
  cluster         = "${aws_ecs_cluster.cluster.id}"
  task_definition = "${aws_ecs_task_definition.service.arn}"
  desired_count   = 2
}
```

```
  # aws_ecs_task_definition.service must be replaced
-/+ resource "aws_ecs_task_definition" "service" {
      ~ arn                      = "arn:aws:ecs:us-west-2:153052954103:task-definition/service:11" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    cpu          = 10
                  - environment  = [] -> null
                    essential    = true
                    image        = "nginx"
                    memory       = 512
                  - mountPoints  = [] -> null
                    name         = "first"
                  ~ portMappings = [
                      ~ {
                            containerPort = 80
                            hostPort      = 80
                          - protocol      = "tcp" -> null
                        },
                    ]
                  - volumesFrom  = [] -> null
                },
            ]
        )
        family                   = "service"
      ~ id                       = "service" -> (known after apply)
      ~ memory                   = "512" -> "0.5GB" # forces replacement
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
    }
```

This also shows some of the same confusion between refreshed values like `[]` and things not provided `null` as inputs.  